mysql> SELECT * FROM students;
+------------+--------------+-----------------------+-----------+-------------------------+--------------+------+--------+
| student_ID | name         | furigana              | nickname  | mail_address            | address      | age  | gender |
+------------+--------------+-----------------------+-----------+-------------------------+--------------+------+--------+
| 1          | 早川健太     | ハヤカワケンタ        | ケンタ    | hayakawa.kenta@aaaa.com | 千葉県       |   25 | 男性   |
| 2          | 木下陸       | キノシタリク          | リク      | kinoshita.riku@aaaa.com | 神奈川県     |   30 | 男性   |
| 3          | 金井由梨     | カナイユリ            | ゆり      | kanai.yuri@aaaa.com     | 大阪府       |   24 | 女性   |
| 4          | 齋藤花子     | サイトウハナコ        | はなこ    | hanako.saito@aaaa.com   | 東京都       |   18 | 女性   |
+------------+--------------+-----------------------+-----------+-------------------------+--------------+------+--------+
4 rows in set (0.00 sec)

mysql> SELECT * FROM students_courses;
+-----------+------------+-------------+------------+------------+
| course_ID | student_ID | course_name | start_date | end_date   |
+-----------+------------+-------------+------------+------------+
| 1         | 2          | JAVA_course | 2025-09-11 | 2025-12-11 |
| 1         | 3          | JAVA_course | 2025-09-30 | 2025-12-30 |
| 1         | 4          | JAVA_course | 2025-06-20 | 2025-09-20 |
| 2         | 1          | AWS_course  | 2025-04-20 | 2025-10-20 |
| 2         | 2          | AWS_course  | 2025-12-19 | 2026-06-19 |
| 2         | 3          | AWS_course  | 2025-09-30 | 2026-03-11 |
+-----------+------------+-------------+------------+------------+
6 rows in set (0.00 sec)

